## Plan Result (prod_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod"
        name                              = "crime-portal-appgw-prod"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-https-listener" -> null
          - name                           = "crime-portal-https-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/sslCertificates/lets_encrypt" -> null
          - ssl_certificate_name           = "lets_encrypt" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod"
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-https-listener"
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/sslCertificates/lets_encrypt"
          + ssl_certificate_name           = "lets_encrypt"
        }

        # (17 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":61,"Program":"tfcmt","SHA1":"","Target":"prod_appgw","Vars":{}} -->